Hey @pabateman 👋 Thank you for taking the time to raise this! There's a couple of factors at play here that are causing the behavior you're seeing.

When you initially apply the configuration from Snippet 1, you're not defining any `ingress` or `egress` blocks, which are processed in [attributes-as-blocks](https://developer.hashicorp.com/terraform/language/attr-as-blocks) mode, so the provider defaults to not managing the ingress/egress rules. This is called out in the linked document, under the "Details" section with this note (emphasis mine):

> ...using nested block syntax in most cases but using argument syntax to represent explicitly the idea of removing all existing objects of that type, **since the absence of any blocks was interpreted as "ignore any existing objects".**

After adding the ingress rule manually via the console, you noted the difference in behavior between plan and apply, where only the latter updates the state. The reason for that is that when Terraform is planning, it's looking for differences in the configuration and reality. Since no `ingress` or `egress` blocks are defined, and thus the provider ignores any existing objects, Terraform does not detect any drift. On the other hand, during the `apply` phase, Terraform reads the upstream resource and saves the current state of reality to the state file (this is a Terraform Core behavior, and not really something that the AWS Provider explicitly controls, outside of telling Terraform what parts of the API response map to what arguments on the resource). This is why the state is updated only after running the `apply`.

Another Terraform (Core) behavior that comes into play with the above is that changes to computed values that are known at plan time, are not used elsewhere in the configuration, and so for almost all purposes aren't relevant, are not shown in the apply output. In your case, this is why the state is "silently" updated with the ingress/egress rule changes that happen in the console. To show this in action, I added the following to the Snippet 1 configuration:

```hcl
output "ingress" {
  value = aws_security_group.example_sg.ingress
}

output "egress" {
  value = aws_security_group.example_sg.egress
}
```

By adding those outputs and then repeating steps 1 and 2 of your reproduction notes (from scratch, without the resources existing before starting the reproduction), the following output is received:

<details><summary>Initial apply (click to expand)</summary>

```console
$ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.example_sg will be created
  + resource "aws_security_group" "example_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "example_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_vpc.example_vpc will be created
  + resource "aws_vpc" "example_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + egress  = (known after apply)
  + ingress = (known after apply)
aws_vpc.example_vpc: Creating...
aws_vpc.example_vpc: Still creating... [10s elapsed]
aws_vpc.example_vpc: Creation complete after 12s [id=vpc-0723d733b47c8cba4]
aws_security_group.example_sg: Creating...
aws_security_group.example_sg: Creation complete after 2s [id=sg-0602d68fccad03f17]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

egress = toset([])
ingress = toset([])
```

</details>

<details><summary>Second plan, after adding a rule via the console (click to expand)</summary>

```console
$ terraform plan
aws_vpc.example_vpc: Refreshing state... [id=vpc-0723d733b47c8cba4]
aws_security_group.example_sg: Refreshing state... [id=sg-0602d68fccad03f17]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # aws_security_group.example_sg has changed
  ~ resource "aws_security_group" "example_sg" {
        id                     = "sg-0602d68fccad03f17"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "example_sg"
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Changes to Outputs:
  ~ ingress = [
      + {
          + cidr_blocks      = [
              + "0.0.0.0/0",
            ]
          + description      = ""
          + from_port        = 0
          + ipv6_cidr_blocks = []
          + prefix_list_ids  = []
          + protocol         = "tcp"
          + security_groups  = []
          + self             = false
          + to_port          = 0
        },
    ]

You can apply this plan to save these new output values to the Terraform state, without changing any real infrastructure.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

That behavior is all controlled by Terraform Core, and so not something the AWS Provider itself has any control over.

The final part of this comes into play once you're looking at Snippet 2. Recalling the attributes-as-blocks documentation I linked to above, the absence the `ingress` argument instructs Terraform to ignore existing objects. On the other hand, defining the `ingress` argument, either as an explicit empty list (`ingress = []`) or by supplying one or more `ingress` blocks, instructs Terraform to (exclusively) manage the ingress rules (or egress rules, where `egress` is defined) for the security group. With that in mind, with Snippet 2, where `ingress` is explicitly defined, Terraform will remove the rule added via the console and add the one defined in the configuration, as you mentioned in your reproduction notes.

With all of this in mind, this appears to be working as expected. Regardless, I'll leave this issue open for now, in case you have any followup questions before we close it out.